Text_Trans3D_compPar_noInter_sametut_bareRun/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-5 -.5 0)
    (15 -.5 0)
    (15  .5 0)
    (-5  .5 0)
    (-5 -.5 8)
    (15 -.5 8)
    (15  .5 8)
    (-5  .5 8)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 1 8) simpleGrading (1 1 1)
);

boundary
(
    front
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    Back
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
	}
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
