Text_Trans3D_compPar_noInter_sametut_bareRun/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



numberOfSubdomains  6;
//method          scotch;

 

decomposer      hierarchical;
distributor     ptscotch;
// distributor     zoltan;
// libs            ("libzoltanDecomp.so");

hierarchicalCoeffs
{
    n               (3 2 1);
    order           xyz;
}

zoltanCoeffs
{
    lb_method       hypergraph;
    lb_approach     partition;
}


// ************************************************************************* //
